PeterVranken/DEVKIT-MPC5748G/samples/CAN/code/system/drivers/CAN/cdr_interruptServiceHandlers.c
/**
 * @file cdr_interruptServiceHandlers.c
 * This file holds the collection of the ISRs needed to serve the CAN devices.\n
 *   Basically, ISRs are device dependent, but the registered handlers branch soon into
 * other functions, which implement most of the actual handler operation. This way, we have
 * a lot of code sharing between the devices. Still, the number of required registered
 * handlers is huge.\n
 *   The large number of registered ISRs is generated by a number of macros, which take
 * device index and related information as argument and can then expand to the needed,
 * specific, registered ISR. Note, the definition of these macros resembles a normal
 * function implementation much more than a typical preprocessor macro. Consequently, we've
 * put them in the function section of this file, where they belong from the logical
 * aspect, rather than in the define section.
 *
 * Copyright (C) 2020 Peter Vranken (mailto:Peter_Vranken@Yahoo.de)
 *
 * This program is free software: you can redistribute it and/or modify it
 * under the terms of the GNU Lesser General Public License as published by the
 * Free Software Foundation, either version 3 of the License, or any later
 * version.
 *
 * This program is distributed in the hope that it will be useful, but WITHOUT
 * ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or
 * FITNESS FOR A PARTICULAR PURPOSE. See the GNU Lesser General Public License
 * for more details.
 *
 * You should have received a copy of the GNU Lesser General Public License
 * along with this program. If not, see <http://www.gnu.org/licenses/>.
 */
/* Module interface
 *   cdr_osRegisterInterrupts
 * Local functions
 *   isrError
 *   ISR_GROUP_ERROR (macro to produce error group ISR)
 *   isrBusOff
 *   ISR_GROUP_BUS_OFF (macro to produce group ISR for bus-off related events)
 *   isrRxFIFOOverflow
 *   isrRxFIFOWarning
 *   isrRxFIFOFramesAvailable
 *   ISR_GROUP_RX_FIFO (macro to produce FIFO group ISR)
 *   isrMailbox
 *   ISR_GROUP_MAILBOX (macro to produce mailbox group ISRs)
 */

/*
 * Include files
 */

#include <stdint.h>
#include <stdbool.h>
#include <stdlib.h>
#include <stdio.h>
#include <assert.h>

#include "MPC5748G.h"
#include "cdr_MPC5748G_CAN.h"

#include "rtos.h"
#include "cdr_searchIFlag.h"
#include "cdr_canDriverAPI.h"
#include "cdr_interruptServiceHandlers.h"


/*
 * Defines
 */


/*
 * Local type definitions
 */


/*
 * Local prototypes
 */


/*
 * Data definitions
 */


/*
 * Function implementation
 */

/**
 * This is the ISR to handle the FLEXCAN_0_ESR interrupt. It reports that at least one of
 * the Error Bits (BIT1ERR, BIT0ERR, ACKERR. CRCERR, FRMERR or STFERR) is set. (See RM
 * 43.4.9, p. 1733.) The handler counts the event, records the cause and optionally invokes
 * a notification callback for further processing in the client code.
 *   @param pDevice
 * The ISR is shared between all CAN devices. The device to operate on is passed in by
 * reference.
 *   @param pDeviceData
 * The ISR is shared between all CAN devices. The run-time data of the device to operate on
 * is passed in by reference.
 *   @param osCallbackOnErr
 * The notification callback into the client code of the driver. Can be NULL to indicate
 * "no notification requested".
 *   @param ESR1
 * The value of the status register ESR1 as found on entry into the ISR.
 */
static void isrError( CAN_Type * const pDevice
                    , cdr_canDeviceData_t * const pDeviceData
                    , cdr_osCallbackOnError_t osCallbackOnErr
                    , uint32_t ESR1
                    )
{
    assert((ESR1 & CAN_ESR1_ERRINT_MASK) != 0);

    /* We record the situation in a global counter. */
    const unsigned int noErr = pDeviceData->noErrEvents+1;
    if(noErr != 0)
        pDeviceData->noErrEvents = noErr;

    /* Check error condition. */
    const uint32_t errMask = CAN_ESR1_STFERR_MASK | CAN_ESR1_FRMERR_MASK | CAN_ESR1_CRCERR_MASK
                             | CAN_ESR1_BIT0ERR_MASK | CAN_ESR1_BIT1ERR_MASK
                             | CAN_ESR1_ACKERR_MASK
                             ;

    /* We record the last recently seen error bits in a global variable. */
    _Static_assert((errMask & 0xffff) == errMask, "Invalid truncation to 16 Bit");
    pDeviceData->lastErrEvent = (uint16_t)(ESR1 & errMask);

    /* Reset the interrupt and overflow flag prior to doing the notification. This
       enables the hardware to catch the next problem already while the callback is
       executing.
         RM 43.4.9, p. 1727ff: The error word contains the interrupt flag aside to the
       status and error bits. Acknowledge the IRQ by w1c.
         Note, this doesn't affect the status and error bits. These had already been
       negated by the read of the ESR1. */
    pDevice->ESR1 = CAN_ESR1_ERRINT_MASK | CAN_ESR1_ERROVR_MASK; /* Clear bits by "w1c" */

    /* Do a notification of the client code if configured. */
    if(osCallbackOnErr != NULL)
        osCallbackOnErr(/* isCanFD */ false, ESR1);

} /* End of isrError */




#define ISR_GROUP_ERROR(canDev)                                                            \
/**                                                                                        \
 * Common ISR for the two Error interrupts (INTERR and INTERR_FAST). It looks for the      \
 * causing IRQ and branches in the dedicated handler. Interrupt acknowledge needs to be    \
 * done in the dedicated handler.                                                          \
 */                                                                                        \
static void isrGroupError_##canDev(void)                                                   \
{                                                                                          \
    CAN_Type * const pDevice = (canDev);                                                   \
                                                                                           \
    /* Read the cause of the error. RM 43.4.9, p. 1727ff. Note, the error bits (not */     \
    /* the interrupt flags and the over overflow bit) are reset by this read. */           \
    const uint32_t ESR1 = pDevice->ESR1;                                                   \
                                                                                           \
    if((ESR1 & CAN_ESR1_ERRINT_MASK) != 0)                                                 \
    {                                                                                      \
        isrError( pDevice                                                                  \
                , &cdr_canDriverData[cdr_canDev_##canDev]                                  \
                , cdr_canDriverConfig[cdr_canDev_##canDev].irqGroupError.osCallbackOnError \
                , ESR1                                                                     \
                );                                                                         \
    }                                                                                      \
    else if((ESR1 & CAN_ESR1_ERRINT_FAST_MASK) != 0)                                       \
        assert(false); /* FD not supported, ISR not implemented. */                        \
    else                                                                                   \
        assert(false);                                                                     \
                                                                                           \
} /* End of isrGroupError_##canDev */



/**
 * This is the ISR to handle the enter/leave bus off state interrupts (ESR1[BOFF_INT] and
 * ESR1[BOFFDONEINT], see RM 43.4.9, p. 1733 and RM 23.1.2 INTC interrupt sources, Table
 * 23-1, p.532. The handler counts occurances, maintains the bus off state for the device
 * and optionally invokes a notification callback for further processing in the client
 * code.
 *   @param pDevice
 * The ISR is shared between all CAN devices. The device to operate on is passed in by
 * reference.
 *   @param pDeviceData
 * The ISR is shared between all CAN devices. The run-time data of the device to operate on
 * is passed in by reference.
 *   @param osCallbackOnBusOff
 * The notification callback into the client code of the driver. Can be NULL to indicate
 * "no notification requested".
 *   @param ESR1
 * The value of the status register ESR1 as found on entry into the ISR.
 *   @remark
 * Our CAN driver has enabled the optio auto-recover from a bus-off state. Therefore,
 * letting the ISR record and notify the situation may already be sufficient. We don't need
 * to actually do something.
 */
static void isrBusOff( CAN_Type * const pDevice
                     , cdr_canDeviceData_t * const pDeviceData
                     , cdr_osCallbackOnError_t osCallbackOnBusOff
                     , uint32_t ESR1
                     )
{
    assert((ESR1 & (CAN_ESR1_BOFFINT_MASK | CAN_ESR1_BOFFDONEINT_MASK)) != 0);

    if((ESR1 & CAN_ESR1_BOFFINT_MASK) != 0)
    {
        /* This IRQ notifies entering the bus off state. */
        pDeviceData->isBusOff = true;

        /* We record the situation in a global counter. */
        const unsigned int noErr = pDeviceData->noBusOffEvents+1;
        if(noErr != 0)
            pDeviceData->noBusOffEvents = noErr;

        /* Reset the interrupt flag prior to doing the notification. This enables the
           hardware to catch the next problem already while the callback is executing.
             RM 43.4.9, p. 1727ff: The error word contains the interrupt flag aside to the
           status and error bits. Acknowledge the IRQ by w1c.
             Note, this doesn't affect the status and error bits. These had already been
           negated by the read of the ESR1. */
        pDevice->ESR1 = CAN_ESR1_BOFFINT_MASK; /* Clear bits by "w1c" */
    }
    else
    {
        /* This IRQ notifies leaving the bus off state, returning to normal operation. */
        assert((ESR1 & CAN_ESR1_BOFFDONEINT_MASK) != 0);
        pDeviceData->isBusOff = false;

        /* Reset the interrupt flag prior to doing the notification. This enables the
           hardware to catch the next problem already while the callback is executing.
             RM 43.4.9, p. 1727ff: The error word contains the interrupt flag aside to the
           status and error bits. Acknowledge the IRQ by w1c.
             Note, this doesn't affect the status and error bits. These had already been
           negated by the read of the ESR1. */
        pDevice->ESR1 = CAN_ESR1_BOFFDONEINT_MASK; /* Clear bits by "w1c" */

    } /* End if(Enter or leave bus-off state?) */

    /* Do a notification of the client code if configured. */
    if(osCallbackOnBusOff != NULL)
        osCallbackOnBusOff(/* enteringBusOff */ pDeviceData->isBusOff, ESR1);

} /* End of isrBusOff */




