PeterVranken/DEVKIT-MPC5748G/samples/CAN/code/system/drivers/CAN/cdr_interruptServiceHandlers.c
#define ISR_GROUP_BUS_OFF(canDev)                                                            \
/**                                                                                          \
 * Common ISR for the bus off related interrupts (BOFFERR, BOFFDONEINT, TWRNINT and          \
 * RWRNINT). It looks for the causing IRQ and branches in the dedicated handler. Interrupt   \
 * acknowledge needs to be done in the dedicated handler.                                    \
 */                                                                                          \
static void isrGroupBusOff_##canDev(void)                                                    \
{                                                                                            \
    CAN_Type * const pDevice = (canDev);                                                     \
                                                                                             \
    /* Read the cause of the error. RM 43.4.9, p. 1727ff. Note, the error bits (not */       \
    /* the interrupt flags and the over overflow bit) are reset by this read. */             \
    const uint32_t ESR1 = pDevice->ESR1;                                                     \
                                                                                             \
    if((ESR1 & (CAN_ESR1_BOFFINT_MASK | CAN_ESR1_BOFFDONEINT_MASK)) != 0)                    \
    {                                                                                        \
        isrBusOff( pDevice                                                                   \
                 , &cdr_canDriverData[cdr_canDev_##canDev]                                   \
                 , cdr_canDriverConfig[cdr_canDev_##canDev].irqGroupBusOff.osCallbackOnBusOff\
                 , ESR1                                                                      \
                 );                                                                          \
    }                                                                                        \
    else if((ESR1 & CAN_ESR1_TWRNINT_MASK) != 0)                                             \
        assert(false); /* This IRQ is not enabled in our driver. */                          \
    else if((ESR1 & CAN_ESR1_RWRNINT_MASK) != 0)                                             \
        assert(false); /* This IRQ is not enabled in our driver. */                          \
    else                                                                                     \
        assert(false);                                                                       \
                                                                                             \
} /* End of isrGroupBusOff_##canDev */



/**
 * This is the ISR to handle the situation that a received CAN message can't be placed into
 * the Rx FIFO because it is still full. The message is lost. The ISR records the situation
 * but can recover from the data loss.
 *   @param pDevice
 * The ISR is shared between all CAN devices. The device to operate on is passed in by
 * reference.
 *   @param pDeviceData
 * The ISR is shared between all CAN devices. The run-time data of the device to operate on
 * is passed in by reference.
 */
static void isrRxFIFOOverflow( CAN_Type * const pDevice
                             , cdr_canDeviceData_t * const pDeviceData
                             )
{
    /* For now, we just record the situation in a global counter. */
    const unsigned int noErr = pDeviceData->noRxFIFOOverflowEvents+1;
    if(noErr != 0)
        pDeviceData->noRxFIFOOverflowEvents = noErr;

    /* RM 43.4.13, p. 1736. Acknowledge the IRQ. */
    const uint32_t irqMaskRxFIFOOverflow = CAN_IFLAG1_BUF7I_MASK;
    assert((pDevice->IFLAG1 & irqMaskRxFIFOOverflow) != 0);
    pDevice->IFLAG1 = irqMaskRxFIFOOverflow; /* Clear bit by "w1c" */

} /* End of isrRxFIFOOverflow */




/**
 * This is the ISR to handle the situation that Rx FIFO is nearly full. A message is
 * however not lost yet. The ISR just records the situation but doesn't take an action.
 *   @param pDevice
 * The ISR is shared between all CAN devices. The device to operate on is passed in by
 * reference.
 *   @param pDeviceData
 * The ISR is shared between all CAN devices. The run-time data of the device to operate on
 * is passed in by reference.
 */
static void isrRxFIFOWarning( CAN_Type * const pDevice
                            , cdr_canDeviceData_t * const pDeviceData
                            )
{
    /* For now, we just record the situation in a counter. */
    const unsigned int noWarn = pDeviceData->noRxFIFOWarningEvents+1;
    if(noWarn != 0)
        pDeviceData->noRxFIFOWarningEvents = noWarn;

    /* RM 43.4.13, p. 1736. Acknowledge the IRQ. */
    const uint32_t irqMaskRxFIFOWarn = CAN_IFLAG1_BUF6I_MASK;
    assert((pDevice->IFLAG1 & irqMaskRxFIFOWarn) != 0);
    pDevice->IFLAG1 = irqMaskRxFIFOWarn; /* Clear bit by "w1c" */

} /* End of isrRxFIFOWarning */




/**
 * This is the principal ISR of the Rx FIFO. It is called on completion of an reception.
 * The ISR fetches the payload and some additional information from the CAN device's
 * registers and invokes a callback to some external code, that does do the further
 * evalutaion of the received message data.
 *   @param pDevice
 * The ISR is shared between all CAN devices. The device to operate on is passed in by
 * reference.
 *   @param pDeviceData
 * The ISR is shared between all CAN devices. The run-time data of the device to operate on
 * is passed in by reference.
 *   @param osCallbackOnRx
 * The notification callback into the client code of the driver.
 */
static void isrRxFIFOFramesAvailable( CAN_Type * const pDevice
                                    , cdr_canDeviceData_t * const pDeviceData
                                    , cdr_osCallbackOnRx_t osCallbackOnRx
                                    )
{
    /* RM 43.4.43, p. 1785: The FIFO is read through the first mailbox in the device RAM.
         Note, the fields inside the C/S word are a bit differently defined as for normal
       mailboxes and we need to apply other access macros. */
    volatile cdr_mailbox_t * const pRxMB = cdr_getMailboxByIdx(pDevice, /* idxMB */ 0);

    /* The ISR doesn't need to loop over all messages currently held in the FIFO. The HW
       maintains the flag coherently with the FIFO contents. If several messages are
       contained then it'll re-assert the flag and we will enter this ISR immediately
       again. (See RM 43.5.8, p. 1810) */
    const uint32_t irqMaskRxFIFO = CAN_IFLAG1_BUF5I_MASK;
    assert((pDevice->IFLAG1 & irqMaskRxFIFO) != 0);

    /* Record the Rx situation in a counter. */
    ++ pDeviceData->noRxMsgsFIFO;

    const uint32_t csWord = pRxMB->csWord
                 , canIdWord = pRxMB->canId;
    const bool isExtID = (csWord & CAN_FIFOCS_IDE_MASK) != 0;
    const unsigned int idHit = (csWord & CAN_FIFOCS_IDHIT_MASK) >> CAN_FIFOCS_IDHIT_SHIFT
                     , DLC = (csWord & CAN_FIFOCS_DLC_MASK) >> CAN_FIFOCS_DLC_SHIFT
                     , timeStamp = (csWord & CAN_FIFOCS_TIME_STAMP_MASK)
                                   >> CAN_FIFOCS_TIME_STAMP_SHIFT
                     , canId = isExtID? (canIdWord & CAN_FIFOID_ID_EXT_MASK)
                                        >> CAN_FIFOID_ID_EXT_SHIFT
                                      : (canIdWord & CAN_FIFOID_ID_STD_MASK)
                                        >> CAN_FIFOID_ID_STD_SHIFT
                     ;

    /* Copy received bytes into local buffer for callback invokation. We copy
       unconditionally. Having conditional code or a byte loop would not save any time. */
    assert(DLC <= 8);
    uint32_t payload_u32[2];
    payload_u32[0] = pRxMB->payload_u32[0];
    payload_u32[1] = pRxMB->payload_u32[1];

    /* Acknowledge the IRQ. For normal MBs, we need to do this prior to reading the
       timer (which unlocks the MB and would enable a re-assertion of the interrupt
       flag). */
    pDevice->IFLAG1 = irqMaskRxFIFO; /* Clear bit by "w1c" */

