PeterVranken/DEVKIT-MPC5748G/samples/CAN/code/system/drivers/CAN/cdr_interruptServiceHandlers.c
    /* Inside the ISR, the busy bit in CODE should never be asserted. */
    assert((CODE & 0x1) == 0);

    /* For Rx messages, we save the payload data prior to acknowledging the reception at
       the HW. */
    uint32_t payload_u32[2]; /* Definition as u32 ensures a safe alignment. */
    if(isRx)
    {
        /* We have an Rx mailbox interrupt. */
        assert(CODE == 2 /* FULL */  ||  CODE == 6 /* OVERRUN */);

        /* Copy received bytes into local buffer for callback invocation. We copy
           unconditionally. Having conditional code or a byte loop would not save any
           time. */
        assert(DLC <= 8);
        payload_u32[0] = pMB->payload_u32[0];
        payload_u32[1] = pMB->payload_u32[1];
    }

    /* RM 43.4.12/13/21, p. 1735ff: Acknowledge the IRQ. We need to do this prior to
       reading the timer (which unlocks the MB and would enable a re-assertion of the
       interrupt flag). */
    assert((*pIFLAG & irqMask) != 0);
    *pIFLAG = irqMask; /* Clear bit by "w1c" */

    /* RM 43.4.4, p. 1721f: Read the timer register to unlock the evaluated mailbox
       (side-effect of reading). See 43.5.7.3 Mailbox lock mechanism, p. 1808ff for
       more details.
         From now on, the mailbox is ready for next reception/transmission. At least
       for Tx, it is essential that we release it prior to invoking the notification
       callback into the client code: The client could implement a buffering strategy
       that wants to re-use the mailbox immediately again for the subsequent message.
       For Rx, it just better to do this before notifying; mailbox hardware and
       callback software can run in parallel. */
    (void)pDevice->TIMER;

    /* Down here, no access to the device hardware is allowed any more. */

    /* The index of the mailbox in the device requires a simple transformation to
       become the mailbox handle. */
    const unsigned int hMB = idxMB + offsMBIdxToHdl;

    if(isRx)
    {
        /* We have an Rx mailbox interrupt. */

        /* Invoke the callback in the client code for further data processing.
             Note, a NULL Pointer check is not needed at run-time. We have double
           checked the configuration at driver initialization time. (Which won't hinder
           us from having an assertion here.) */
        assert(pIrqConfig->osCallbackOnRx != NULL);
        (*pIrqConfig->osCallbackOnRx)( hMB
                                     , isExtID
                                     , canId
                                     , DLC
                                     , (const uint8_t *)&payload_u32[0]
                                     , timeStamp
                                     );
    }
    else
    {
        /* We have a Tx mailbox interrupt. */

        assert(CODE == 8 /* INACTIVE */  ||  CODE == 9 /* ABORT */);

        /* Invoke the callback in the client code for further data processing.
             Note, a NULL Pointer check is not needed at run-time. We have double
           checked the configuration at driver initialization time. (Which won't hinder
           us from having an assertion here.) */
        assert(pIrqConfig->osCallbackOnTx != NULL);
        (*pIrqConfig->osCallbackOnTx)( hMB
                                     , isExtID
                                     , canId
                                     , DLC
                                     , /* isAborted */ CODE == 9
                                     , timeStamp
                                     );
    }
} /* End of isrMailbox */




#define ISR_GROUP_MAILBOX(canDev, idxIFLAG, idxFrom, idxTo, sizeGrpAsPow2)                  \
/**                                                                                         \
 * Common ISR for the mailbox interrupts of mailboxes idxFrom till and including idxTo. It  \
 * branches in the common mailbox interrupt handler implementation with the information     \
 * about which CAN device and which mailbox group caused the reset. Interrupt acknowledge   \
 * needs to be done in the common mailbox handler. Splitting this ISR from the common       \
 * implementation of mailbox processing avoids code duplication for all mailbox interrupts. \
 */                                                                                         \
static void isrGroupMB##idxFrom##_##idxTo##_##canDev(void)                                  \
{                                                                                           \
    _Static_assert( (idxIFLAG) >= 1  &&  (idxIFLAG) <= 3                                    \
                    &&  (idxFrom) >= 0  &&  (idxFrom) <= 64                                 \
                    &&  (idxTo)-(idxFrom)+1 >= 4  &&  (idxTo)-(idxFrom)+1 <= 32             \
                    &&  (idxTo)-(idxFrom)+1 == 1u<<(sizeGrpAsPow2)                          \
                    &&  ((idxTo)-(idxFrom)+1) % 4 == 0                                      \
                    &&  (idxFrom)/32 == (idxTo)/32                                          \
                    &&  cdr_canDev_##canDev < sizeOfAry(cdr_canDriverConfig)                \
                  , "Bad arguments passed to macro ISR_GROUP_MAILBOX to generate mailbox"   \
                    " ISR"                                                                  \
                  );                                                                        \
                                                                                            \
    const cdr_canDeviceConfig_t * const pDeviceConfig =                                     \
                                        &cdr_canDriverConfig[cdr_canDev_##canDev];          \
                                                                                            \
    /* The index of the mailbox in the device and the mailbox handle are related by a */    \
    /* non-zero offset if the FIFO is enabled. Needed for client notification. */           \
    const unsigned int MBHdlMinusIdx = cdr_getAdditionalCapacityDueToFIFO(pDeviceConfig);   \
                                                                                            \
    /* Here, we know very well, which device and interrupt we are. We can figure out, which \
       interrupt flag register to use with which masks and all of this without any runtime  \
       overhead: The macro arguments idxFrom and idxTo are constants and what looks like    \
       runtime computation in the source code is just loading a constant value into the     \
       register or using an immediate shift distance in the compiled code. */               \
    _Static_assert                                                                          \
            ( offsetof(CAN_Type, IMASK##idxIFLAG)                                           \
              + 2*sizeof(uint32_t) == offsetof(CAN_Type, IFLAG##idxIFLAG)                   \
            , "Implementation doesn't match the register structure of the CAN device"       \
            );                                                                              \
    volatile uint32_t * const pIFLAG = &canDev->IFLAG##idxIFLAG                             \
                    , * const pIMASK = pIFLAG-2;                                            \
    const unsigned int shiftGrpInIFLAG = (idxFrom)-32u*((idxIFLAG)-1u);                     \
    const uint32_t maskedIFLAGRightAligned = (*pIFLAG & *pIMASK) >> shiftGrpInIFLAG;        \
    const unsigned int idxIFlag = cdr_findAssertedBitInWord( maskedIFLAGRightAligned        \
                                                           , sizeGrpAsPow2                  \
                                                           )                                \
                                  + shiftGrpInIFLAG;                                        \
    assert(idxIFlag - shiftGrpInIFLAG <= (idxTo)-(idxFrom)+1);                              \
    isrMailbox( canDev                                                                      \
              , pIFLAG                                                                      \
              , /* irqMask */ 1u<<idxIFlag                                                  \
              , /* idxMB */ idxIFlag + 32u*((idxIFLAG)-1u)                                  \
              , MBHdlMinusIdx                                                               \
              , &pDeviceConfig->irqGroupMB##idxFrom##_##idxTo                               \
              );                                                                            \
} /* End of isrGroupMB##idxFrom##_##idxTo##_##canDev */



