PeterVranken/DEVKIT-MPC5748G/samples/CAN/code/system/drivers/CAN/cdr_interruptServiceHandlers.c
/* We need the ISRs for each device separately. This is done easiest by making the set of
   ISRs for a single device a define, which is then repeatedly applied. */
#define SET_OF_DEVICE_ISRS(idxCanDev)                                                       \
ISR_GROUP_RX_FIFO(CAN_##idxCanDev)                                                          \
ISR_GROUP_ERROR(CAN_##idxCanDev)                                                            \
ISR_GROUP_BUS_OFF(CAN_##idxCanDev)                                                          \
ISR_GROUP_MAILBOX(CAN_##idxCanDev, /* idxIFLAG */ 1, /* idxFrom */ 0, /* idxTo */ 3, 2)     \
ISR_GROUP_MAILBOX(CAN_##idxCanDev, /* idxIFLAG */ 1, /* idxFrom */ 4, /* idxTo */ 7, 2)     \
ISR_GROUP_MAILBOX(CAN_##idxCanDev, /* idxIFLAG */ 1, /* idxFrom */ 8, /* idxTo */ 11, 2)    \
ISR_GROUP_MAILBOX(CAN_##idxCanDev, /* idxIFLAG */ 1, /* idxFrom */ 12, /* idxTo */ 15, 2)   \
ISR_GROUP_MAILBOX(CAN_##idxCanDev, /* idxIFLAG */ 1, /* idxFrom */ 16, /* idxTo */ 31, 4)   \
ISR_GROUP_MAILBOX(CAN_##idxCanDev, /* idxIFLAG */ 2, /* idxFrom */ 32, /* idxTo */ 63, 5)   \
ISR_GROUP_MAILBOX(CAN_##idxCanDev, /* idxIFLAG */ 3, /* idxFrom */ 64, /* idxTo */ 95, 5)

#if CDR_ENABLE_USE_OF_CAN_0 == 1
SET_OF_DEVICE_ISRS(/* idxCanDev */ 0)
#endif
#if CDR_ENABLE_USE_OF_CAN_1 == 1
SET_OF_DEVICE_ISRS(/* idxCanDev */ 1)
#endif
#if CDR_ENABLE_USE_OF_CAN_2 == 1
SET_OF_DEVICE_ISRS(/* idxCanDev */ 2)
#endif
#if CDR_ENABLE_USE_OF_CAN_3 == 1
SET_OF_DEVICE_ISRS(/* idxCanDev */ 3)
#endif
#if CDR_ENABLE_USE_OF_CAN_4 == 1
SET_OF_DEVICE_ISRS(/* idxCanDev */ 4)
#endif
#if CDR_ENABLE_USE_OF_CAN_5 == 1
SET_OF_DEVICE_ISRS(/* idxCanDev */ 5)
#endif
#if CDR_ENABLE_USE_OF_CAN_6 == 1
SET_OF_DEVICE_ISRS(/* idxCanDev */ 6)
#endif
#if CDR_ENABLE_USE_OF_CAN_7 == 1
SET_OF_DEVICE_ISRS(/* idxCanDev */ 7)
#endif

#undef ISR_GROUP_RX_FIFO
#undef ISR_GROUP_MAILBOX
#undef SET_OF_DEVICE_ISRS



/**
 * Our locally implemented interrupt handlers are registered at the operating system for
 * serving the mailbox and FIFO interrupts.
 *   @param idxCanDevice
 * The CAN device to register the interrupts for by index. The available index range
 * depends on the configuration of the set of enabled CAN devices, see e.g.
 * #CDR_ENABLE_USE_OF_CAN_0. The most convenient way to provide the appropriate index is
 * using enumeration cdr_canDevice_t.
 */
void cdr_osRegisterInterrupts(unsigned int idxCanDevice)
{
    assert(idxCanDevice < sizeOfAry(cdr_canDriverConfig));
    const cdr_canDeviceConfig_t * const pDeviceConfig = &cdr_canDriverConfig[idxCanDevice];

    /** Helper macro to maintian readability of initializer expression of next data object,
        a constant table of interrupt handlers. */
    #define SET_OF_CAN_ISRS(canDev)                 \
    { .isrGroupFIFO = isrGroupRxFIFO_##canDev,      \
      .isrGroupError = isrGroupError_##canDev,      \
      .isrGroupBusOff = isrGroupBusOff_##canDev,    \
      .isrGroupMB0_3 = isrGroupMB0_3_##canDev,      \
      .isrGroupMB4_7 = isrGroupMB4_7_##canDev,      \
      .isrGroupMB8_11 = isrGroupMB8_11_##canDev,    \
      .isrGroupMB12_15 = isrGroupMB12_15_##canDev,  \
      .isrGroupMB16_31 = isrGroupMB16_31_##canDev,  \
      .isrGroupMB32_63 = isrGroupMB32_63_##canDev,  \
      .isrGroupMB64_95 = isrGroupMB64_95_##canDev,  \
    },

    /** This is a table, which holds pointers to all required ISRs. It is just needed to have a
        function that registers these interrupts. The alternative would be a long list of
        dedicated calls of the register-function. Either solutions won't make a significant
        difference in terms of ROM consumption. */
    static const struct setOfCanISRs_t
    {
        void (*isrGroupFIFO)(void);   /** Hdlr for all Rx FIFO related interrupts. */
        void (*isrGroupError)(void);  /** Hdlr for all interrupts ERRINT and ERRINT_FAST. */
        void (*isrGroupBusOff)(void); /** Hdlr for all Bus off and warning interrupts. */
        void (*isrGroupMB0_3)(void);  /** Hdlr for all Rc/Tx interrupts of mailboxes 0..3. */
        void (*isrGroupMB4_7)(void);  /** Hdlr for all Rc/Tx interrupts of mailboxes 4..7. */
        void (*isrGroupMB8_11)(void); /** Hdlr for all Rc/Tx interrupts of mailboxes 8..11. */
        void (*isrGroupMB12_15)(void);/** Hdlr for all Rc/Tx interrupts of mailboxes 12..15. */
        void (*isrGroupMB16_31)(void);/** Hdlr for all Rc/Tx interrupts of mailboxes 16..31. */
        void (*isrGroupMB32_63)(void);/** Hdlr for all Rc/Tx interrupts of mailboxes 32..63. */
        void (*isrGroupMB64_95)(void);/** Hdlr for all Rc/Tx interrupts of mailboxes 64..95. */

    } mapDevIdxToISRGroup_[cdr_canDev_noCANDevicesEnabled] =
        {
#if CDR_ENABLE_USE_OF_CAN_0 == 1
            SET_OF_CAN_ISRS(CAN_0)
#endif
#if CDR_ENABLE_USE_OF_CAN_1 == 1
            SET_OF_CAN_ISRS(CAN_1)
#endif
#if CDR_ENABLE_USE_OF_CAN_2 == 1
            SET_OF_CAN_ISRS(CAN_2)
#endif
#if CDR_ENABLE_USE_OF_CAN_3 == 1
            SET_OF_CAN_ISRS(CAN_3)
#endif
#if CDR_ENABLE_USE_OF_CAN_4 == 1
            SET_OF_CAN_ISRS(CAN_4)
#endif
#if CDR_ENABLE_USE_OF_CAN_5 == 1
            SET_OF_CAN_ISRS(CAN_5)
#endif
#if CDR_ENABLE_USE_OF_CAN_6 == 1
            SET_OF_CAN_ISRS(CAN_6)
#endif
#if CDR_ENABLE_USE_OF_CAN_7 == 1
            SET_OF_CAN_ISRS(CAN_7)
#endif
    };
    #undef SET_OF_CAN_ISRS

    /* Interrupt offsets are taken from MCU reference manual, see 23.1.2 INTC interrupt
       sources, p. 523ff, Table 23-1.
         The interrupts are regularly defined, therefore we can compute the wanted
       number. The only exception is the very first IRQ, related to pretended network,
       which is available only in device CAN_0. */
    #define IDX_IRQ_CAN_FIFO(idxDev)                    (IDX_IRQ_CAN_MB(idxDev, /* idxMB */ 5))
    #define IDX_IRQ_CAN_ERROR(idxDev)                   (CAN0_Error_IRQn + 12*(idxDev))
    #define IDX_IRQ_CAN_BOFF_OR_TX_WARN(idxDev)         (CAN0_ORed_IRQn + 12*(idxDev))
    #define IDX_IRQ_CAN_MB(idxDev, idxMB)                                                     \
                            (CAN0_ORed_00_03_MB_IRQn + 12u*(idxDev)                           \
                             + ((idxMB)<16u? (idxMB)/4u: ((idxMB)<32u? 4u: (idxMB-32)/32u+5u))\
                            )

    /* A few sample tests. */
    _Static_assert( IDX_IRQ_CAN_ERROR(0) == CAN0_Error_IRQn
                    &&  IDX_IRQ_CAN_ERROR(7) == CAN7_Error_IRQn
                    &&  IDX_IRQ_CAN_BOFF_OR_TX_WARN(1) == CAN1_ORed_IRQn
                    &&  IDX_IRQ_CAN_BOFF_OR_TX_WARN(6) == CAN6_ORed_IRQn
                    &&  IDX_IRQ_CAN_BOFF_OR_TX_WARN(7) == CAN7_ORed_IRQn
                    &&  IDX_IRQ_CAN_MB(0, 0) == CAN0_ORed_00_03_MB_IRQn
                    &&  IDX_IRQ_CAN_MB(0, 3) == CAN0_ORed_00_03_MB_IRQn
                    &&  IDX_IRQ_CAN_MB(0, 5) == CAN0_ORed_04_07_MB_IRQn
                    &&  IDX_IRQ_CAN_MB(0, 7) == CAN0_ORed_04_07_MB_IRQn
                    &&  IDX_IRQ_CAN_MB(1, 4) == CAN1_ORed_04_07_MB_IRQn
                    &&  IDX_IRQ_CAN_MB(2, 8) == CAN2_ORed_08_11_MB_IRQn
                    &&  IDX_IRQ_CAN_MB(3, 11) == CAN3_ORed_08_11_MB_IRQn
                    &&  IDX_IRQ_CAN_MB(3, 12) == CAN3_ORed_12_15_MB_IRQn
                    &&  IDX_IRQ_CAN_MB(3, 15) == CAN3_ORed_12_15_MB_IRQn
                    &&  IDX_IRQ_CAN_MB(4, 16) == CAN4_ORed_16_31_MB_IRQn
                    &&  IDX_IRQ_CAN_MB(5, 17) == CAN5_ORed_16_31_MB_IRQn
                    &&  IDX_IRQ_CAN_MB(5, 31) == CAN5_ORed_16_31_MB_IRQn
                    &&  IDX_IRQ_CAN_MB(6, 32) == CAN6_ORed_32_63_MB_IRQn
                    &&  IDX_IRQ_CAN_MB(6, 33) == CAN6_ORed_32_63_MB_IRQn
                    &&  IDX_IRQ_CAN_MB(7, 32) == CAN7_ORed_32_63_MB_IRQn
                    &&  IDX_IRQ_CAN_MB(7, 63) == CAN7_ORed_32_63_MB_IRQn
                    &&  IDX_IRQ_CAN_MB(7, 64) == CAN7_ORed_64_95_MB_IRQn
                    &&  IDX_IRQ_CAN_MB(7, 95) == CAN7_ORed_64_95_MB_IRQn
                    &&  IDX_IRQ_CAN_MB(7, 0) == CAN7_ORed_00_03_MB_IRQn
                    &&  IDX_IRQ_CAN_FIFO(0) == IDX_IRQ_CAN_MB(0, 5)
                    &&  IDX_IRQ_CAN_FIFO(3) == IDX_IRQ_CAN_MB(3, 6)
                    &&  IDX_IRQ_CAN_FIFO(7) == IDX_IRQ_CAN_MB(7, 7)
                  , "Test of computation of IRQ vector numbers failed"
                  );

    /* Register our IRQ handlers. */
    assert(idxCanDevice < sizeOfAry(mapDevIdxToISRGroup_));

    /* Register the error interrupts. Actually, we just have ERRINT. The only other
       interrupt in this group, ERRINT_FAST, relates to CAN FD. */
    rtos_osRegisterInterruptHandler
            ( /* ISR */           mapDevIdxToISRGroup_[idxCanDevice].isrGroupError
            , /* processorID */   pDeviceConfig->irqGroupError.idxTargetCore
            , /* vectorNum */     IDX_IRQ_CAN_ERROR(idxCanDevice)
            , /* psrPriority */   pDeviceConfig->irqGroupError.irqPrio
            , /* isPreemptable */ true
            );

    /* Register the bus off interrupts. Actually, we only support BOFFINT and BOFFDONEINT.
       The two warning IRQs (error counter exceeds first watermark) are not handled and not
       enabled. */
    rtos_osRegisterInterruptHandler
            ( /* ISR */           mapDevIdxToISRGroup_[idxCanDevice].isrGroupBusOff
            , /* processorID */   pDeviceConfig->irqGroupBusOff.idxTargetCore
            , /* vectorNum */     IDX_IRQ_CAN_BOFF_OR_TX_WARN(idxCanDevice)
            , /* psrPriority */   pDeviceConfig->irqGroupBusOff.irqPrio
            , /* isPreemptable */ true
            );

    if(pDeviceConfig->isFIFOEnabled)
    {
        /* Register the FIFO interrupts. */
        rtos_osRegisterInterruptHandler
                ( /* ISR */           mapDevIdxToISRGroup_[idxCanDevice].isrGroupFIFO
                , /* processorID */   pDeviceConfig->irqGroupFIFO.idxTargetCore
                , /* vectorNum */     IDX_IRQ_CAN_FIFO(idxCanDevice)
                , /* psrPriority */   pDeviceConfig->irqGroupFIFO.irqPrio
                , /* isPreemptable */ true
                );
    }

    /* With enabled FIFO, the first mailboxes are not in normal operation and we must
       not register their interrupts. */
    const unsigned int idxFirstNormalMailbox = cdr_getIdxOfFirstNormalMailbox(pDeviceConfig);
    #define REGISTER_ISR(idxFrom, idxTo)                                                    \
    if(idxFirstNormalMailbox <= (idxTo))                                                    \
    {                                                                                       \
        rtos_osRegisterInterruptHandler                                                     \
            ( /* ISR */ mapDevIdxToISRGroup_[idxCanDevice].isrGroupMB##idxFrom##_##idxTo    \
            , /* processorID */ pDeviceConfig->irqGroupMB##idxFrom##_##idxTo.idxTargetCore  \
            , /* vectorNum */ IDX_IRQ_CAN_MB(idxCanDevice, /* idxMB */ (idxTo))             \
            , /* psrPriority */ pDeviceConfig->irqGroupMB##idxFrom##_##idxTo.irqPrio        \
            , /* isPreemptable */ true                                                      \
            );                                                                              \
    }
    REGISTER_ISR(/* idxFrom */ 0, /* idxTo */ 3)
    REGISTER_ISR(/* idxFrom */ 4, /* idxTo */ 7)
    REGISTER_ISR(/* idxFrom */ 8, /* idxTo */ 11)
    REGISTER_ISR(/* idxFrom */ 12, /* idxTo */ 15)
    REGISTER_ISR(/* idxFrom */ 16, /* idxTo */ 31)
    REGISTER_ISR(/* idxFrom */ 32, /* idxTo */ 63)
    REGISTER_ISR(/* idxFrom */ 64, /* idxTo */ 95)
    #undef REGISTER_ISR

    #undef IDX_IRQ_CAN_FIFO
    #undef IDX_IRQ_CAN_ERROR
    #undef IDX_IRQ_CAN_BOFF_OR_TX_WARN
    #undef IDX_IRQ_CAN_MB
} /* End of cdr_osRegisterInterrupts */



